{
  "spec_id": "spec.LEASE.alterations_and_modifications.reinstatement_at_end.v1",
  "contract_type": "LEASE",
  "clause_type": "reinstatement_at_end",
  "jurisdiction": "General/KSA",
  "purpose": "تنظيم التزامات المستأجر أو المؤجر بشأن إعادة العين إلى حالتها الأصلية أو المتفق عليها عند انتهاء العقد.",
  "scope": {
    "applies_when": [
      "يتناول البند ما إذا كان يجب على المستأجر إزالة التعديلات وإعادة الحال لما كان عليه.",
      "يتكلم عن استثناء بعض التحسينات التي يرغب المؤجر في الإبقاء عليها.",
      "يطلب المستخدم فهم ما يقع عليه من التزامات بخصوص التعديلات عند الإخلاء."
    ],
    "does_not_apply_when": [
      "الاستحقاقات المالية الأخرى عند انتهاء العقد مثل الأجرة المتبقية أو التأمين (تعالج في فروع أخرى).",
      "المطالبات المتعلقة بالعيوب الأصلية في العقار التي لا علاقة لها بتعديلات المستأجر."
    ]
  },
  "allowed": {
    "model_may": [
      "تلخيص ما إذا كان العقد يلزم المستأجر بإعادة العين كما كانت أو ترك التعديلات.",
      "اقتراح صياغة تنظم متى يمكن للمؤجر أن يطلب إزالة التعديلات أو قبول بقائها بدون مقابل أو بمقابل.",
      "التنبيه إلى الغموض الذي قد يؤدي لنزاع حول من يتحمل تكاليف الإزالة أو إعادة الدهان وغيرها."
    ]
  },
  "disallowed": {
    "model_must_not": [
      "افتراض أن المستأجر ملزم دائمًا بإعادة العقار لحالة (جديدة تمامًا) بما يتجاوز إزالة التعديلات.",
      "افتراض أن كل التعديلات تصبح ملكًا للمؤجر دون تعويض ومن دون نص.",
      "تجاهل الفرق بين الاستهلاك الطبيعي وبين الأثر المتبقي للتعديلات التي أجراها المستأجر."
    ]
  },
  "required_reasoning": {
    "before_answer_think_about": [
      "هل ينص العقد على (إعادة الحال إلى ما كان عليه)؟ وكيف تُفسر؟",
      "هل يذكر استثناءات للتحسينات التي يرغب المؤجر في الإبقاء عليها؟",
      "هل يحدد العقد آلية اتفاق الطرفين قرب نهاية المدة على ما يُزال وما يُترك؟"
    ],
    "potential_risk_signals": [
      "نصوص عامة وغامضة عن (إعادة الحال) دون توضيح نطاقها.",
      "عدم التطرق لمسألة من يتحمل تكلفة إزالة التعديلات الثقيلة أو الإنشائية.",
      "خلاف بين الطرفين عند الإخلاء حول ما إذا كان تركيب معين تحسينًا أو عبئًا يجب إزالته."
    ]
  },
  "edge_cases": {
    "model_must_know": [
      "إعادة الدهان إلى اللون الأصلي المتفق عليه.",
      "إزالة القواطع أو التركيبات الخاصة التي أضافها المستأجر لغرض نشاطه.",
      "اتفاق الطرفين على إبقاء بعض التحسينات مقابل عدم مطالبة المستأجر بقيمتها."
    ]
  },
  "safe_completion_rules": {
    "if_request_is_illegal_or_risky": {
      "model_should": [
        "رفض التفسيرات التي تُثقل على المستأجر بما يتجاوز إزالة التعديلات التي قام بها واستعادة الحالة المعقولة.",
        "اقتراح تنظيم واضح يحدد ما يجب إزالته وما يمكن إبقاؤه واتفاق الطرفين على ذلك قبل الإخلاء."
      ],
      "response_template": "لا أنصح بتفسير بند (إعادة الحال إلى ما كان عليه) بشكل متطرف يلزم المستأجر بتحمل كل أثر للاستعمال الطبيعي أو تحسينات استفاد منها المؤجر أيضًا، كما لا أنصح بتجاهل التزامه بإزالة التعديلات الخاصة التي أجراها. يمكنني مساعدتك في توضيح هذه الحدود واقتراح صياغة متوازنة في العقود الجديدة."
    }
  }
}